/** \file
 * \brief ELF file format definitions
 */

/*
 * Copyright (c) 2007, 2008, 2009, 2010, ETH Zurich.
 * All rights reserved.
 *
 * This file is distributed under the terms in the attached LICENSE file.
 * If you do not find this file, copies can be found by writing to:
 * ETH Zurich D-INFK, Haldeneggsteig 4, CH-8092 Zurich. Attn: Systems Group.
 */

/*-
 * Copyright (c) 1998 John D. Polstra.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)

#define R_X86_64_TLSLD          20      /* PC relative offset to LD GOT entry */
#define R_X86_64_DTPOFF32       21      /* Offset in TLS block */
#define R_X86_64_GOTTPOFF       22      /* PC relative offset to IE GOT entry */
#define R_X86_64_TPOFF32        23      /* Offset in static TLS block */

/* i386 relocations.  */
#define R_386_NONE              0       /* No relocation. */
#define R_386_32                1       /* Add symbol value. */
#define R_386_PC32              2       /* Add PC-relative symbol value. */
#define R_386_GOT32             3       /* Add PC-relative GOT offset. */
#define R_386_PLT32             4       /* Add PC-relative PLT offset. */
#define R_386_COPY              5       /* Copy data from shared object. */
#define R_386_GLOB_DAT          6       /* Set GOT entry to data address. */
#define R_386_JMP_SLOT          7       /* Set GOT entry to code address. */
#define R_386_RELATIVE          8       /* Add load address of shared object. */
#define R_386_GOTOFF            9       /* Add GOT-relative symbol address. */
#define R_386_GOTPC             10      /* Add PC-relative GOT table address. */
#define R_386_TLS_TPOFF         14      /* Negative offset in static TLS block */
#define R_386_TLS_IE            15      /* Absolute address of GOT for -ve static TLS */
#define R_386_TLS_GOTIE         16      /* GOT entry for negative static TLS block */
#define R_386_TLS_LE            17      /* Negative offset relative to static TLS */
#define R_386_TLS_GD            18      /* 32 bit offset to GOT (index,off) pair */
#define R_386_TLS_LDM           19      /* 32 bit offset to GOT (index,zero) pair */
#define R_386_TLS_GD_32         24      /* 32 bit offset to GOT (index,off) pair */
#define R_386_TLS_GD_PUSH       25      /* pushl instruction for Sun ABI GD sequence */
#define R_386_TLS_GD_CALL       26      /* call instruction for Sun ABI GD sequence */
#define R_386_TLS_GD_POP        27      /* popl instruction for Sun ABI GD sequence */
#define R_386_TLS_LDM_32        28      /* 32 bit offset to GOT (index,zero) pair */
#define R_386_TLS_LDM_PUSH      29      /* pushl instruction for Sun ABI LD sequence */
#define R_386_TLS_LDM_CALL      30      /* call instruction for Sun ABI LD sequence */
#define R_386_TLS_LDM_POP       31      /* popl instruction for Sun ABI LD sequence */
#define R_386_TLS_LDO_32        32      /* 32 bit offset from start of TLS block */
#define R_386_TLS_IE_32         33      /* 32 bit offset to GOT static TLS offset entry */
#define R_386_TLS_LE_32         34      /* 32 bit offset within static TLS block */
#define R_386_TLS_DTPMOD32      35      /* GOT entry containing TLS index */
#define R_386_TLS_DTPOFF32      36      /* GOT entry containing TLS offset */
#define R_386_TLS_TPOFF32       37      /* GOT entry of -ve static TLS offset */

/* ARM relocations. A LOT MISSING! */
#define R_ARM_NONE				0
#define R_ARM_ABS32				2
#define R_ARM_RELATIVE			23

/**
 * \brief ELF64 file header.
 */
struct Elf64_Ehdr {
    uint8_t        e_ident[EI_NIDENT];
    uint16_t       e_type;
    uint16_t       e_machine;
    uint32_t       e_version;
    uint64_t       e_entry;
    uint64_t       e_phoff;
    uint64_t       e_shoff;
    uint32_t       e_flags;
    uint16_t       e_ehsize;
    uint16_t       e_phentsize;
    uint16_t       e_phnum;
    uint16_t       e_shentsize;
    uint16_t       e_shnum;
    uint16_t       e_shstrndx;
} __attribute__ ((packed));

/**
 * \brief ELF64 program header.
 */
struct Elf64_Phdr {
    uint32_t        p_type;
    uint32_t        p_flags;
    uint64_t        p_offset;
    uint64_t        p_vaddr;
    uint64_t        p_paddr;
    uint64_t        p_filesz;
    uint64_t        p_memsz;
    uint64_t        p_align;
} __attribute__ ((packed));

/**
 * \brief ELF64 section header.
 */
struct Elf64_Shdr {
    uint32_t    sh_name;
    uint32_t    sh_type;
    uint64_t    sh_flags;
    uint64_t    sh_addr;
    uint64_t    sh_offset;
    uint64_t    sh_size;
    uint32_t    sh_link;
    uint32_t    sh_info;
    uint64_t    sh_addralign;
    uint64_t    sh_entsize;
} __attribute__ ((packed));

/**
 * \brief ELF64 relocation entry.
 */
struct Elf64_Rela {
    uint64_t    r_offset;
    uint64_t    r_info;
    int64_t     r_addend;
} __attribute__ ((packed));

/**
 * \brief ELF64 symbol table entry.
 */
struct Elf64_Sym {
    uint32_t        st_name;
    uint8_t         st_info;
    uint8_t         st_other;
    uint16_t        st_shndx;
    uint64_t        st_value;
    uint64_t        st_size;
} __attribute__ ((packed));

/**
 * \brief ELF64 Dynamic section entry
 */
struct Elf64_Dyn {
    int64_t         d_tag;
    union {
        uint64_t    d_val;
        uint64_t    d_ptr;
    } d_un;
} __attribute__ ((packed));

/**
 * \brief ELF32 file header.
 */
struct Elf32_Ehdr {
    uint8_t  e_ident[EI_NIDENT];        // 00
    uint16_t e_type;                    // 16
    uint16_t e_machine;                 // 18
    uint32_t e_version;                 // 20
    uint32_t e_entry;                   // 24
    uint32_t e_phoff;                   // 28
    uint32_t e_shoff;                   // 32
    uint32_t e_flags;                   // 36
    uint16_t e_ehsize;                  // 40
    uint16_t e_phentsize;               // 42
    uint16_t e_phnum;                   // 44
    uint16_t e_shentsize;               // 46
    uint16_t e_shnum;                   // 48
    uint16_t e_shstrndx;                // 50
};

/**
 * \brief ELF32 program header.
 */
struct  Elf32_Phdr {
    uint32_t p_type;                    // 0
    uint32_t p_offset;                  // 4
    uint32_t p_vaddr;                   // 8
    uint32_t p_paddr;                   // 12
    uint32_t p_filesz;                  // 16
    uint32_t p_memsz;                   // 20
    uint32_t p_flags;                   // 24
    uint32_t p_align;                   // 28
};

/**
 * \brief ELF32 section header.
 */
struct Elf32_Shdr {
    uint32_t sh_name;                   // 0
    uint32_t sh_type;                   // 4
    uint32_t sh_flags;                  // 8
    uint32_t sh_addr;                   // 12
    uint32_t sh_offset;                 // 16
    uint32_t sh_size;                   // 20
    uint32_t sh_link;                   // 24
    uint32_t sh_info;                   // 28
    uint32_t sh_addralign;              // 32
    uint32_t sh_entsize;                // 36
};

/**
 * \brief ELF32 relocation entry.
 */
struct Elf32_Rel {
    uint32_t r_offset;
    uint32_t r_info;
};

/**
 * \brief ELF32 relocation entry with addend.
 */
struct Elf32_Rela {
    uint32_t r_offset;
    uint32_t r_info;
    int32_t  r_addend;
};

/**
 * \brief ELF32 symbol table entry.
 */
struct Elf32_Sym {
    uint32_t st_name;
    uint32_t st_value;
    uint32_t st_size;
    uint8_t  st_info;
    uint8_t  st_other;
    uint16_t st_shndx;
};


struct Elf32_Dyn {
    int32_t          d_tag;
    union {
        uint32_t     d_val;
        uint32_t     d_ptr;
    } d_un;
} __attribute__ ((packed));

struct Elf64_Shdr *
elf64_find_section_header_type(struct Elf64_Shdr *shdr,
                               uint32_t entries, uint32_t type);
struct Elf32_Shdr *
elf32_find_section_header_type(struct Elf32_Shdr *shdr,
                               uint32_t entries, uint32_t type);

struct Elf64_Shdr *
